# RevisionCloudRevisionIssuedBy Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RevisionCloudRevisionIssuedBy Property
ParameterTypeId Class See Also
---
"Issued by"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RevisionCloudRevisionIssuedBy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RevisionCloudRevisionIssuedBy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RevisionCloudRevisionIssuedBy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace